Tekla Open API Reference for Tekla Structures 2025
Fitting Properties
The Fitting type exposes the following members.
Properties
Name | Description
Father
 The father object of the boolean operation; the model object instance to operate on.
 (Inherited from Boolean.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Plane
 The plane that fits the part.
Top
See Also
Reference
Fitting Class
Tekla.Structures.Model Namespace